# schedule buttons
MONDAY = 'Розклад на понеділок'
TUESDAY = 'Розклад на вівторок'
WEDNESDAY = 'Розклад на середу'
THURSDAY = 'Розклад на четвер'
FRIDAY = 'Розклад на п\'ятницю'
WEEK = 'Розклад на тиждень'
NEXT_WEEK = 'Розклад на наступний тиждень'
PRIMARY = 'Тепер цей розклад є основним!'
NOT_PRIMARY = 'Цей розклад більще не є основним'
FAVORITE = "Розклад був успішно доданий до обраних!"
NOT_FAVORITE = 'Розклад був успішно видалений з обраних'
FAVORITE_LIMIT = 'Неможливо додати розклад в обрані: перевищенно ліміт'
TOO_LONG = 'На жаль, повідомлення з розкладом є надто великим! ' \
           'Спробуйте обрати конкретний день тижня.'
# settings
SETTINGS_CHANGED = 'Налаштування змінено!'
