# favorites
from bot.storage.placeholders import buttons

SELECT_FROM_LIST = 'Виберіть зі списку:'
NOT_PICKED_ANY_GROUP = 'Вибачте, ви не додали жодної групи'
NOT_FOUND_OR_DELETED = 'Вибачте, даний розклад не знайдено чи було видалено'

# menu
PICK_OPTION = 'Будь ласка, виберіть бажану опцію'
TIP = 'От халепа! Схоже, ви ще не додали основний розклад! Підказати як це зробити?'

# schedule buttons
MENU = '<em><strong>Головне меню!</strong></em>'
TIP_ANSWER = f'Натисніть кнопку <b>"{buttons.FIND_SCHEDULE}"</b>.\n\n' \
             'Здійсніть пошук за групою чи викладачем/-кою. ' \
             'Щойно розклад відобразиться, оберіть пункт ' \
             '<b>"Позначити основним"</b>.\n\n' \
             f'Виконавши ці кроки, наступного разу при натисканні кнопки {buttons.MY_SCHEDULE} ' \
             f'відобразиться даний розклад'

# search
SEARCH_PARAMS = 'Будь ласка, оберіть параметри пошуку розкладу'
CHOOSE_ROLE = 'Вкажіть роль'
GROUP_FULL_NAME = 'Надішліть повну назву шуканої групи'

PICK_SPECIALITY = 'Оберіть спеціальність'
PICK_SPECIALITY_FAIL = 'Будь ласка, оберіть спеціальність'

TEACHER_SELECT = "Оберіть викладача із запропонованих"
TEACHER_INITIALS = "Введіть П.І.Б. викладача/-ки"
TEACHER_INITIALS_FAIL = "Будь ласка, введіть П.І.Б. викладача"
TEACHER_NOT_FOUND = 'Вчителя не знайдено! Спробуйте ще раз!'

COURSE_NUM = '%s курс'
COURSE_SELECT = 'Оберіть курс'
COURSE_SELECT_FAIL = 'Будь ласка, оберіть курс'

GROUP_SELECT = 'Оберіть групу'
GROUP_SELECT_FAIL = 'Будь ласка, оберіть групу'
GROUP_NOT_FOUND = 'Групу не знайдено! Спробуйте ще раз!'

# settings
SETTINGS_INFO = 'Тут ви можете змінювати ваші налаштування'
YOUR_SETTINGS = 'Ваші поточні налаштування:'

# start
WELCOME = 'Вітаю, %s!\n' \
          'Я -- офіційний бот-асистент від Університету Короля Данила!\n'

#    UTILS
# render_schedule
NO_CLASSES = '\nЦього дня у вас немає пар, хорошого відпочинку!'
BREAK_LINE = '_'*35
CLASSES_QUANTITY = f'{BREAK_LINE}\n' \
                   '<code>Загальна кількість пар: %s </code>'
SEARCH_NAME = '<code><u>%s</u></code>'
DAY_AND_DATE = '<code><u>%s, %s</u></code>'
LESSON = '%s <b>%s</b> | %s\n'\
         '<i>%s</i> (%s)\n'\
         '<pre>%s</pre>\n'
# schedule_utils
YOUR_SCHEDULE = 'Ваш розклад:'

# help
HELP = 'Вітаємо!\n'\
       'Ви перебуваєте у офіційному телеграм-боті УКД для пошуку розкладу\n\n'\
       'Бот має наступний функціонал: пошук розкладу, позначенням його основним або додаванням до обраних.\n\n'\
       f'Щоб знайти потрібний розклад, натисніть кнопку <b>"{buttons.FIND_SCHEDULE}"</b>' \
       ' та виберіть необхідні параметри: пошук за спеціальністю/викладачем чи повною назвою групи.\n' \
       'Щоб знайти викладача, необхідно надіслати його прізвище/ім\'я у пошук та вибрати потрібний варіант.\n\n' \
       f'Під розкладом ви можете знайти дві кнопки: <b>"{buttons.PRIMARY_PICK}"</b> ' \
       f'та <b>"{buttons.FAVORITE_PICK}"</b>.\nПозначивши розклад основним, ви зможете переглянути його ' \
       f'натиском кнопки <b>"{buttons.MY_SCHEDULE}"</b> та будете отримувати сповіщення о 6 ранку, якщо у вас' \
       f'цього дня є розклад та увімкнутий параметр <b>"{buttons.SEND_MORNING_SCHEDULE % buttons.YES}"</b> у налаштуваннях.\n' \
       f'Якщо ви позначите розклад обраним, ви зможете його швидко знайти завдяки кнопці ' \
       f'<b>"{buttons.FAVORITES}"</b>. Ліміт обраних - 10.\n\n' \
       f'<i><b>Команди:</b></i>\n' \
       f'/start - перезапуск бота\n' \
       f'/cancel - скасування останньої дії\n' \
       f'/settings - налаштування бота\n' \
       f'/help - виклик меню допомоги\n\n' \
       f'При виявленні неполадок просимо звертатись на пошту tel.admin@ukd.edu.ua'

